Microchip-MPLAB-Harmony/reference_apps/apps/pic32cm_mc00_cnano/pic32cmmc_getting_started/firmware/src/packs/PIC32CM1216MC00032_DFP/pic32cm1216mc00032.h
/* CMSIS includes */
#include "core_cm0plus.h"
#if defined USE_CMSIS_INIT
#include "system_pic32cmmc00.h"
#endif /* USE_CMSIS_INIT */

/* ************************************************************************** */
/*   SOFTWARE PERIPHERAL API DEFINITION FOR PIC32CM1216MC00032                */
/* ************************************************************************** */
#include "component/ac.h"
#include "component/adc.h"
#include "component/ccl.h"
#include "component/dac.h"
#include "component/divas.h"
#include "component/dmac.h"
#include "component/dsu.h"
#include "component/eic.h"
#include "component/evsys.h"
#include "component/freqm.h"
#include "component/fuses.h"
#include "component/gclk.h"
#include "component/hmatrixb.h"
#include "component/mclk.h"
#include "component/mtb.h"
#include "component/nvmctrl.h"
#include "component/osc32kctrl.h"
#include "component/oscctrl.h"
#include "component/pac.h"
#include "component/pdec.h"
#include "component/pm.h"
#include "component/port.h"
#include "component/rstc.h"
#include "component/rtc.h"
#include "component/sdadc.h"
#include "component/sercom.h"
#include "component/supc.h"
#include "component/tc.h"
#include "component/tcc.h"
#include "component/tsens.h"
#include "component/wdt.h"

/* ************************************************************************** */
/*   INSTANCE DEFINITIONS FOR PIC32CM1216MC00032 */
/* ************************************************************************** */
#include "instance/ac.h"
#include "instance/adc0.h"
#include "instance/adc1.h"
#include "instance/ccl.h"
#include "instance/dac.h"
#include "instance/divas.h"
#include "instance/dmac.h"
#include "instance/dsu.h"
#include "instance/eic.h"
#include "instance/evsys.h"
#include "instance/freqm.h"
#include "instance/fuses.h"
#include "instance/gclk.h"
#include "instance/hmatrixhs.h"
#include "instance/mclk.h"
#include "instance/mtb.h"
#include "instance/nvmctrl.h"
#include "instance/osc32kctrl.h"
#include "instance/oscctrl.h"
#include "instance/pac.h"
#include "instance/pdec.h"
#include "instance/pm.h"
#include "instance/port.h"
#include "instance/rstc.h"
#include "instance/rtc.h"
#include "instance/sdadc.h"
#include "instance/sercom0.h"
#include "instance/sercom1.h"
#include "instance/sercom2.h"
#include "instance/sercom3.h"
#include "instance/supc.h"
#include "instance/tc0.h"
#include "instance/tc1.h"
#include "instance/tc2.h"
#include "instance/tc3.h"
#include "instance/tc4.h"
#include "instance/tcc0.h"
#include "instance/tcc1.h"
#include "instance/tcc2.h"
#include "instance/tsens.h"
#include "instance/wdt.h"

/* ************************************************************************** */
/*  PERIPHERAL ID DEFINITIONS FOR PIC32CM1216MC00032                          */
/* ************************************************************************** */
#define ID_PAC           (  0) /* Instance index for PAC (PAC) */
#define ID_PM            (  1) /* Instance index for PM (PM) */
#define ID_MCLK          (  2) /* Instance index for MCLK (MCLK) */
#define ID_RSTC          (  3) /* Instance index for RSTC (RSTC) */
#define ID_OSCCTRL       (  4) /* Instance index for OSCCTRL (OSCCTRL) */
#define ID_OSC32KCTRL    (  5) /* Instance index for OSC32KCTRL (OSC32KCTRL) */
#define ID_SUPC          (  6) /* Instance index for SUPC (SUPC) */
#define ID_GCLK          (  7) /* Instance index for GCLK (GCLK) */
#define ID_WDT           (  8) /* Instance index for WDT (WDT) */
#define ID_RTC           (  9) /* Instance index for RTC (RTC) */
#define ID_EIC           ( 10) /* Instance index for EIC (EIC) */
#define ID_FREQM         ( 11) /* Instance index for FREQM (FREQM) */
#define ID_TSENS         ( 12) /* Instance index for TSENS (TSENS) */
#define ID_PORT          ( 32) /* Instance index for PORT (PORT) */
#define ID_DSU           ( 33) /* Instance index for DSU (DSU) */
#define ID_NVMCTRL       ( 34) /* Instance index for NVMCTRL (NVMCTRL) */
#define ID_DMAC          ( 35) /* Instance index for DMAC (DMAC) */
#define ID_MTB           ( 36) /* Instance index for MTB (MTB) */
#define ID_HMATRIXHS     ( 37) /* Instance index for HMATRIXHS (HMATRIXHS) */
#define ID_EVSYS         ( 64) /* Instance index for EVSYS (EVSYS) */
#define ID_SERCOM0       ( 65) /* Instance index for SERCOM0 (SERCOM0) */
#define ID_SERCOM1       ( 66) /* Instance index for SERCOM1 (SERCOM1) */
#define ID_SERCOM2       ( 67) /* Instance index for SERCOM2 (SERCOM2) */
#define ID_SERCOM3       ( 68) /* Instance index for SERCOM3 (SERCOM3) */
#define ID_TCC0          ( 73) /* Instance index for TCC0 (TCC0) */
#define ID_TCC1          ( 74) /* Instance index for TCC1 (TCC1) */
#define ID_TCC2          ( 75) /* Instance index for TCC2 (TCC2) */
#define ID_TC0           ( 76) /* Instance index for TC0 (TC0) */
#define ID_TC1           ( 77) /* Instance index for TC1 (TC1) */
#define ID_TC2           ( 78) /* Instance index for TC2 (TC2) */
#define ID_TC3           ( 79) /* Instance index for TC3 (TC3) */
#define ID_TC4           ( 80) /* Instance index for TC4 (TC4) */
#define ID_ADC0          ( 81) /* Instance index for ADC0 (ADC0) */
#define ID_ADC1          ( 82) /* Instance index for ADC1 (ADC1) */
#define ID_SDADC         ( 83) /* Instance index for SDADC (SDADC) */
#define ID_AC            ( 84) /* Instance index for AC (AC) */
#define ID_DAC           ( 85) /* Instance index for DAC (DAC) */
#define ID_CCL           ( 87) /* Instance index for CCL (CCL) */
#define ID_PDEC          ( 90) /* Instance index for PDEC (PDEC) */

#define ID_PERIPH_MAX    ( 90) /* Number of peripheral IDs */

/* ************************************************************************** */
/*   REGISTER STRUCTURE ADDRESS DEFINITIONS FOR PIC32CM1216MC00032            */
/* ************************************************************************** */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#define AC_REGS                          ((ac_registers_t*)0x42005000)                 /* AC Registers Address         */
#define ADC0_REGS                        ((adc_registers_t*)0x42004400)                /* ADC0 Registers Address       */
#define ADC1_REGS                        ((adc_registers_t*)0x42004800)                /* ADC1 Registers Address       */
#define CCL_REGS                         ((ccl_registers_t*)0x42005c00)                /* CCL Registers Address        */
#define DAC_REGS                         ((dac_registers_t*)0x42005400)                /* DAC Registers Address        */
#define DIVAS_REGS                       ((divas_registers_t*)0x48000000)              /* DIVAS Registers Address      */
#define DMAC_REGS                        ((dmac_registers_t*)0x41006000)               /* DMAC Registers Address       */
#define DSU_REGS                         ((dsu_registers_t*)0x41002000)                /* DSU Registers Address        */
#define EIC_REGS                         ((eic_registers_t*)0x40002800)                /* EIC Registers Address        */
#define EVSYS_REGS                       ((evsys_registers_t*)0x42000000)              /* EVSYS Registers Address      */
#define FREQM_REGS                       ((freqm_registers_t*)0x40002c00)              /* FREQM Registers Address      */
#define GCLK_REGS                        ((gclk_registers_t*)0x40001c00)               /* GCLK Registers Address       */
#define HMATRIXHS_REGS                   ((hmatrixb_registers_t*)0x4100a000)           /* HMATRIXHS Registers Address  */
#define MCLK_REGS                        ((mclk_registers_t*)0x40000800)               /* MCLK Registers Address       */
#define MTB_REGS                         ((mtb_registers_t*)0x41008000)                /* MTB Registers Address        */
#define NVMCTRL_REGS                     ((nvmctrl_registers_t*)0x41004000)            /* NVMCTRL Registers Address    */
#define OTP5_FUSES_REGS                  ((fuses_otp5_fuses_registers_t*)0x00806020)   /* FUSES Registers Address      */
#define TEMP_LOG_FUSES_REGS              ((fuses_temp_log_fuses_registers_t*)0x00806030) /* FUSES Registers Address      */
#define USER_FUSES_REGS                  ((fuses_user_fuses_registers_t*)0x00804000)   /* FUSES Registers Address      */
#define OSCCTRL_REGS                     ((oscctrl_registers_t*)0x40001000)            /* OSCCTRL Registers Address    */
#define OSC32KCTRL_REGS                  ((osc32kctrl_registers_t*)0x40001400)         /* OSC32KCTRL Registers Address */
#define PAC_REGS                         ((pac_registers_t*)0x40000000)                /* PAC Registers Address        */
#define PDEC_REGS                        ((pdec_registers_t*)0x42006800)               /* PDEC Registers Address       */
#define PM_REGS                          ((pm_registers_t*)0x40000400)                 /* PM Registers Address         */
#define PORT_REGS                        ((port_registers_t*)0x41000000)               /* PORT Registers Address       */
#define PORT_IOBUS_REGS                  ((port_registers_t*)0x60000000)               /* PORT Registers Address       */
#define RSTC_REGS                        ((rstc_registers_t*)0x40000c00)               /* RSTC Registers Address       */
#define RTC_REGS                         ((rtc_registers_t*)0x40002400)                /* RTC Registers Address        */
#define SDADC_REGS                       ((sdadc_registers_t*)0x42004c00)              /* SDADC Registers Address      */
#define SERCOM0_REGS                     ((sercom_registers_t*)0x42000400)             /* SERCOM0 Registers Address    */
#define SERCOM1_REGS                     ((sercom_registers_t*)0x42000800)             /* SERCOM1 Registers Address    */
#define SERCOM2_REGS                     ((sercom_registers_t*)0x42000c00)             /* SERCOM2 Registers Address    */
#define SERCOM3_REGS                     ((sercom_registers_t*)0x42001000)             /* SERCOM3 Registers Address    */
#define SUPC_REGS                        ((supc_registers_t*)0x40001800)               /* SUPC Registers Address       */
#define TC0_REGS                         ((tc_registers_t*)0x42003000)                 /* TC0 Registers Address        */
#define TC1_REGS                         ((tc_registers_t*)0x42003400)                 /* TC1 Registers Address        */
#define TC2_REGS                         ((tc_registers_t*)0x42003800)                 /* TC2 Registers Address        */
#define TC3_REGS                         ((tc_registers_t*)0x42003c00)                 /* TC3 Registers Address        */
#define TC4_REGS                         ((tc_registers_t*)0x42004000)                 /* TC4 Registers Address        */
#define TCC0_REGS                        ((tcc_registers_t*)0x42002400)                /* TCC0 Registers Address       */
#define TCC1_REGS                        ((tcc_registers_t*)0x42002800)                /* TCC1 Registers Address       */
#define TCC2_REGS                        ((tcc_registers_t*)0x42002c00)                /* TCC2 Registers Address       */
#define TSENS_REGS                       ((tsens_registers_t*)0x40003000)              /* TSENS Registers Address      */
#define WDT_REGS                         ((wdt_registers_t*)0x40002000)                /* WDT Registers Address        */
#endif /* (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

/* ************************************************************************** */
/*   BASE ADDRESS DEFINITIONS FOR PIC32CM1216MC00032                          */
/* ************************************************************************** */
#define AC_BASE_ADDRESS                  _UL_(0x42005000)                              /* AC Base Address */
#define ADC0_BASE_ADDRESS                _UL_(0x42004400)                              /* ADC0 Base Address */
#define ADC1_BASE_ADDRESS                _UL_(0x42004800)                              /* ADC1 Base Address */
#define CCL_BASE_ADDRESS                 _UL_(0x42005c00)                              /* CCL Base Address */
#define DAC_BASE_ADDRESS                 _UL_(0x42005400)                              /* DAC Base Address */
#define DIVAS_BASE_ADDRESS               _UL_(0x48000000)                              /* DIVAS Base Address */
#define DMAC_BASE_ADDRESS                _UL_(0x41006000)                              /* DMAC Base Address */
#define DSU_BASE_ADDRESS                 _UL_(0x41002000)                              /* DSU Base Address */
#define EIC_BASE_ADDRESS                 _UL_(0x40002800)                              /* EIC Base Address */
#define EVSYS_BASE_ADDRESS               _UL_(0x42000000)                              /* EVSYS Base Address */
#define FREQM_BASE_ADDRESS               _UL_(0x40002c00)                              /* FREQM Base Address */
#define GCLK_BASE_ADDRESS                _UL_(0x40001c00)                              /* GCLK Base Address */
#define HMATRIXHS_BASE_ADDRESS           _UL_(0x4100a000)                              /* HMATRIXHS Base Address */
#define MCLK_BASE_ADDRESS                _UL_(0x40000800)                              /* MCLK Base Address */
#define MTB_BASE_ADDRESS                 _UL_(0x41008000)                              /* MTB Base Address */
#define NVMCTRL_BASE_ADDRESS             _UL_(0x41004000)                              /* NVMCTRL Base Address */
#define OTP5_FUSES_BASE_ADDRESS          _UL_(0x00806020)                              /* FUSES Base Address */
#define TEMP_LOG_FUSES_BASE_ADDRESS      _UL_(0x00806030)                              /* FUSES Base Address */
#define USER_FUSES_BASE_ADDRESS          _UL_(0x00804000)                              /* FUSES Base Address */
#define OSCCTRL_BASE_ADDRESS             _UL_(0x40001000)                              /* OSCCTRL Base Address */
#define OSC32KCTRL_BASE_ADDRESS          _UL_(0x40001400)                              /* OSC32KCTRL Base Address */
#define PAC_BASE_ADDRESS                 _UL_(0x40000000)                              /* PAC Base Address */
#define PDEC_BASE_ADDRESS                _UL_(0x42006800)                              /* PDEC Base Address */
#define PM_BASE_ADDRESS                  _UL_(0x40000400)                              /* PM Base Address */
#define PORT_BASE_ADDRESS                _UL_(0x41000000)                              /* PORT Base Address */
#define PORT_IOBUS_BASE_ADDRESS          _UL_(0x60000000)                              /* PORT Base Address */
#define RSTC_BASE_ADDRESS                _UL_(0x40000c00)                              /* RSTC Base Address */
#define RTC_BASE_ADDRESS                 _UL_(0x40002400)                              /* RTC Base Address */
#define SDADC_BASE_ADDRESS               _UL_(0x42004c00)                              /* SDADC Base Address */
#define SERCOM0_BASE_ADDRESS             _UL_(0x42000400)                              /* SERCOM0 Base Address */
#define SERCOM1_BASE_ADDRESS             _UL_(0x42000800)                              /* SERCOM1 Base Address */
#define SERCOM2_BASE_ADDRESS             _UL_(0x42000c00)                              /* SERCOM2 Base Address */
#define SERCOM3_BASE_ADDRESS             _UL_(0x42001000)                              /* SERCOM3 Base Address */
#define SUPC_BASE_ADDRESS                _UL_(0x40001800)                              /* SUPC Base Address */
#define TC0_BASE_ADDRESS                 _UL_(0x42003000)                              /* TC0 Base Address */
#define TC1_BASE_ADDRESS                 _UL_(0x42003400)                              /* TC1 Base Address */
#define TC2_BASE_ADDRESS                 _UL_(0x42003800)                              /* TC2 Base Address */
#define TC3_BASE_ADDRESS                 _UL_(0x42003c00)                              /* TC3 Base Address */
#define TC4_BASE_ADDRESS                 _UL_(0x42004000)                              /* TC4 Base Address */
#define TCC0_BASE_ADDRESS                _UL_(0x42002400)                              /* TCC0 Base Address */
#define TCC1_BASE_ADDRESS                _UL_(0x42002800)                              /* TCC1 Base Address */
#define TCC2_BASE_ADDRESS                _UL_(0x42002c00)                              /* TCC2 Base Address */
#define TSENS_BASE_ADDRESS               _UL_(0x40003000)                              /* TSENS Base Address */
#define WDT_BASE_ADDRESS                 _UL_(0x40002000)                              /* WDT Base Address */

/* ************************************************************************** */
/*   PIO DEFINITIONS FOR PIC32CM1216MC00032                                   */
/* ************************************************************************** */
#include "pio/pic32cm1216mc00032.h"

/* ************************************************************************** */
/*   MEMORY MAPPING DEFINITIONS FOR PIC32CM1216MC00032                        */
/* ************************************************************************** */

#define FLASH_SIZE                     _UL_(0x00020000)    /*  128kB Memory segment type: flash */
#define FLASH_PAGE_SIZE                _UL_(        64)
#define FLASH_NB_OF_PAGES              _UL_(      2048)

#define OTP5_SIZE                      _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define TEMP_LOG_SIZE                  _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define USER_PAGE_SIZE                 _UL_(0x00000100)    /*    0kB Memory segment type: user_page */
#define USER_PAGE_PAGE_SIZE            _UL_(        64)
#define USER_PAGE_NB_OF_PAGES          _UL_(         4)

#define DATAFLASH_SIZE                 _UL_(0x00001000)    /*    4kB Memory segment type: flash */
#define DATAFLASH_PAGE_SIZE            _UL_(        64)
#define DATAFLASH_NB_OF_PAGES          _UL_(        64)

