Microchip-MPLAB-Harmony/reference_apps/apps/pic32cm_mc00_cnano/pic32cmmc_getting_started/firmware/src/packs/PIC32CM1216MC00032_DFP/pic32cm1216mc00032.h
#define HSRAM_SIZE                     _UL_(0x00004000)    /*   16kB Memory segment type: ram */
#define HPB0_SIZE                      _UL_(0x00004000)    /*   16kB Memory segment type: io */
#define HPB1_SIZE                      _UL_(0x00010000)    /*   64kB Memory segment type: io */
#define HPB2_SIZE                      _UL_(0x00008000)    /*   32kB Memory segment type: io */
#define DIVAS_SIZE                     _UL_(0x00000020)    /*    0kB Memory segment type: io */
#define PPB_SIZE                       _UL_(0x00100000)    /* 1024kB Memory segment type: io */
#define SCS_SIZE                       _UL_(0x00001000)    /*    4kB Memory segment type: io */
#define PERIPHERALS_SIZE               _UL_(0x20000000)    /* 524288kB Memory segment type: io */

#define FLASH_ADDR                     _UL_(0x00000000)    /* FLASH base address (type: flash)*/
#define OTP5_ADDR                      _UL_(0x00806020)    /* OTP5 base address (type: fuses)*/
#define TEMP_LOG_ADDR                  _UL_(0x00806030)    /* TEMP_LOG base address (type: fuses)*/
#define USER_PAGE_ADDR                 _UL_(0x00804000)    /* USER_PAGE base address (type: user_page)*/
#define DATAFLASH_ADDR                 _UL_(0x00400000)    /* DATAFLASH base address (type: flash)*/
#define HSRAM_ADDR                     _UL_(0x20000000)    /* HSRAM base address (type: ram)*/
#define HPB0_ADDR                      _UL_(0x40000000)    /* HPB0 base address (type: io)*/
#define HPB1_ADDR                      _UL_(0x41000000)    /* HPB1 base address (type: io)*/
#define HPB2_ADDR                      _UL_(0x42000000)    /* HPB2 base address (type: io)*/
#define DIVAS_ADDR                     _UL_(0x48000000)    /* DIVAS base address (type: io)*/
#define PPB_ADDR                       _UL_(0xe0000000)    /* PPB base address (type: io)*/
#define SCS_ADDR                       _UL_(0xe000e000)    /* SCS base address (type: io)*/
#define PERIPHERALS_ADDR               _UL_(0x40000000)    /* PERIPHERALS base address (type: io)*/

/* ************************************************************************** */
/*   DEVICE SIGNATURES FOR PIC32CM1216MC00032                                 */
/* ************************************************************************** */
#define CHIP_DSU_DID                   _UL_(0X11070100)

/* ************************************************************************** */
/*   ELECTRICAL DEFINITIONS FOR PIC32CM1216MC00032                            */
/* ************************************************************************** */

/* ************************************************************************** */
/* Event Generator IDs for C32CM1216MC00032 */
/* ************************************************************************** */
#define EVENT_ID_GEN_OSCCTRL_XOSC_FAIL                    1 /* ID for OSCCTRL event generator XOSC_FAIL */
#define EVENT_ID_GEN_OSC32KCTRL_XOSC32K_FAIL              2 /* ID for OSC32KCTRL event generator XOSC32K_FAIL */
#define EVENT_ID_GEN_RTC_CMP_0                            3 /* ID for RTC event generator CMP_0 */
#define EVENT_ID_GEN_RTC_CMP_1                            4 /* ID for RTC event generator CMP_1 */
#define EVENT_ID_GEN_RTC_OVF                              5 /* ID for RTC event generator OVF */
#define EVENT_ID_GEN_RTC_PER_0                            6 /* ID for RTC event generator PER_0 */
#define EVENT_ID_GEN_RTC_PER_1                            7 /* ID for RTC event generator PER_1 */
#define EVENT_ID_GEN_RTC_PER_2                            8 /* ID for RTC event generator PER_2 */
#define EVENT_ID_GEN_RTC_PER_3                            9 /* ID for RTC event generator PER_3 */
#define EVENT_ID_GEN_RTC_PER_4                           10 /* ID for RTC event generator PER_4 */
#define EVENT_ID_GEN_RTC_PER_5                           11 /* ID for RTC event generator PER_5 */
#define EVENT_ID_GEN_RTC_PER_6                           12 /* ID for RTC event generator PER_6 */
#define EVENT_ID_GEN_RTC_PER_7                           13 /* ID for RTC event generator PER_7 */
#define EVENT_ID_GEN_EIC_EXTINT_0                        14 /* ID for EIC event generator EXTINT_0 */
#define EVENT_ID_GEN_EIC_EXTINT_1                        15 /* ID for EIC event generator EXTINT_1 */
#define EVENT_ID_GEN_EIC_EXTINT_2                        16 /* ID for EIC event generator EXTINT_2 */
#define EVENT_ID_GEN_EIC_EXTINT_3                        17 /* ID for EIC event generator EXTINT_3 */
#define EVENT_ID_GEN_EIC_EXTINT_4                        18 /* ID for EIC event generator EXTINT_4 */
#define EVENT_ID_GEN_EIC_EXTINT_5                        19 /* ID for EIC event generator EXTINT_5 */
#define EVENT_ID_GEN_EIC_EXTINT_6                        20 /* ID for EIC event generator EXTINT_6 */
#define EVENT_ID_GEN_EIC_EXTINT_7                        21 /* ID for EIC event generator EXTINT_7 */
#define EVENT_ID_GEN_EIC_EXTINT_8                        22 /* ID for EIC event generator EXTINT_8 */
#define EVENT_ID_GEN_EIC_EXTINT_9                        23 /* ID for EIC event generator EXTINT_9 */
#define EVENT_ID_GEN_EIC_EXTINT_10                       24 /* ID for EIC event generator EXTINT_10 */
#define EVENT_ID_GEN_EIC_EXTINT_11                       25 /* ID for EIC event generator EXTINT_11 */
#define EVENT_ID_GEN_EIC_EXTINT_12                       26 /* ID for EIC event generator EXTINT_12 */
#define EVENT_ID_GEN_EIC_EXTINT_13                       27 /* ID for EIC event generator EXTINT_13 */
#define EVENT_ID_GEN_EIC_EXTINT_14                       28 /* ID for EIC event generator EXTINT_14 */
#define EVENT_ID_GEN_EIC_EXTINT_15                       29 /* ID for EIC event generator EXTINT_15 */
#define EVENT_ID_GEN_TSENS_WINMON                        30 /* ID for TSENS event generator WINMON */
#define EVENT_ID_GEN_DMAC_CH_0                           31 /* ID for DMAC event generator CH_0 */
#define EVENT_ID_GEN_DMAC_CH_1                           32 /* ID for DMAC event generator CH_1 */
#define EVENT_ID_GEN_DMAC_CH_2                           33 /* ID for DMAC event generator CH_2 */
#define EVENT_ID_GEN_DMAC_CH_3                           34 /* ID for DMAC event generator CH_3 */
#define EVENT_ID_GEN_TCC0_OVF                            35 /* ID for TCC0 event generator OVF */
#define EVENT_ID_GEN_TCC0_TRG                            36 /* ID for TCC0 event generator TRG */
#define EVENT_ID_GEN_TCC0_CNT                            37 /* ID for TCC0 event generator CNT */
#define EVENT_ID_GEN_TCC0_MC_0                           38 /* ID for TCC0 event generator MC_0 */
#define EVENT_ID_GEN_TCC0_MC_1                           39 /* ID for TCC0 event generator MC_1 */
#define EVENT_ID_GEN_TCC0_MC_2                           40 /* ID for TCC0 event generator MC_2 */
#define EVENT_ID_GEN_TCC0_MC_3                           41 /* ID for TCC0 event generator MC_3 */
#define EVENT_ID_GEN_TCC1_OVF                            42 /* ID for TCC1 event generator OVF */
#define EVENT_ID_GEN_TCC1_TRG                            43 /* ID for TCC1 event generator TRG */
#define EVENT_ID_GEN_TCC1_CNT                            44 /* ID for TCC1 event generator CNT */
#define EVENT_ID_GEN_TCC1_MC_0                           45 /* ID for TCC1 event generator MC_0 */
#define EVENT_ID_GEN_TCC1_MC_1                           46 /* ID for TCC1 event generator MC_1 */
#define EVENT_ID_GEN_TCC2_OVF                            47 /* ID for TCC2 event generator OVF */
#define EVENT_ID_GEN_TCC2_TRG                            48 /* ID for TCC2 event generator TRG */
#define EVENT_ID_GEN_TCC2_CNT                            49 /* ID for TCC2 event generator CNT */
#define EVENT_ID_GEN_TCC2_MC_0                           50 /* ID for TCC2 event generator MC_0 */
#define EVENT_ID_GEN_TCC2_MC_1                           51 /* ID for TCC2 event generator MC_1 */
#define EVENT_ID_GEN_TC0_OVF                             52 /* ID for TC0 event generator OVF */
#define EVENT_ID_GEN_TC0_MC_0                            53 /* ID for TC0 event generator MC_0 */
#define EVENT_ID_GEN_TC0_MC_1                            54 /* ID for TC0 event generator MC_1 */
#define EVENT_ID_GEN_TC1_OVF                             55 /* ID for TC1 event generator OVF */
#define EVENT_ID_GEN_TC1_MC_0                            56 /* ID for TC1 event generator MC_0 */
#define EVENT_ID_GEN_TC1_MC_1                            57 /* ID for TC1 event generator MC_1 */
#define EVENT_ID_GEN_TC2_OVF                             58 /* ID for TC2 event generator OVF */
#define EVENT_ID_GEN_TC2_MC_0                            59 /* ID for TC2 event generator MC_0 */
#define EVENT_ID_GEN_TC2_MC_1                            60 /* ID for TC2 event generator MC_1 */
#define EVENT_ID_GEN_TC3_OVF                             61 /* ID for TC3 event generator OVF */
#define EVENT_ID_GEN_TC3_MC_0                            62 /* ID for TC3 event generator MC_0 */
#define EVENT_ID_GEN_TC3_MC_1                            63 /* ID for TC3 event generator MC_1 */
#define EVENT_ID_GEN_TC4_OVF                             64 /* ID for TC4 event generator OVF */
#define EVENT_ID_GEN_TC4_MC_0                            65 /* ID for TC4 event generator MC_0 */
#define EVENT_ID_GEN_TC4_MC_1                            66 /* ID for TC4 event generator MC_1 */
#define EVENT_ID_GEN_ADC0_RESRDY                         67 /* ID for ADC0 event generator RESRDY */
#define EVENT_ID_GEN_ADC0_WINMON                         68 /* ID for ADC0 event generator WINMON */
#define EVENT_ID_GEN_ADC1_RESRDY                         69 /* ID for ADC1 event generator RESRDY */
#define EVENT_ID_GEN_ADC1_WINMON                         70 /* ID for ADC1 event generator WINMON */
#define EVENT_ID_GEN_SDADC_RESRDY                        71 /* ID for SDADC event generator RESRDY */
#define EVENT_ID_GEN_SDADC_WINMON                        72 /* ID for SDADC event generator WINMON */
#define EVENT_ID_GEN_AC_COMP_0                           73 /* ID for AC event generator COMP_0 */
#define EVENT_ID_GEN_AC_COMP_1                           74 /* ID for AC event generator COMP_1 */
#define EVENT_ID_GEN_AC_WIN_0                            75 /* ID for AC event generator WIN_0 */
#define EVENT_ID_GEN_DAC_EMPTY                           76 /* ID for DAC event generator EMPTY */
#define EVENT_ID_GEN_CCL_LUTOUT_0                        77 /* ID for CCL event generator LUTOUT_0 */
#define EVENT_ID_GEN_CCL_LUTOUT_1                        78 /* ID for CCL event generator LUTOUT_1 */
#define EVENT_ID_GEN_CCL_LUTOUT_2                        79 /* ID for CCL event generator LUTOUT_2 */
#define EVENT_ID_GEN_CCL_LUTOUT_3                        80 /* ID for CCL event generator LUTOUT_3 */
#define EVENT_ID_GEN_PAC_ACCERR                          81 /* ID for PAC event generator ACCERR */
#define EVENT_ID_GEN_PDEC_OVF                            83 /* ID for PDEC event generator OVF */
#define EVENT_ID_GEN_PDEC_ERR                            84 /* ID for PDEC event generator ERR */
#define EVENT_ID_GEN_PDEC_DIR                            85 /* ID for PDEC event generator DIR */
#define EVENT_ID_GEN_PDEC_VLC                            86 /* ID for PDEC event generator VLC */
#define EVENT_ID_GEN_PDEC_MC_0                           87 /* ID for PDEC event generator MC_0 */
#define EVENT_ID_GEN_PDEC_MC_1                           88 /* ID for PDEC event generator MC_1 */

/* ************************************************************************** */
/*  Event User IDs for C32CM1216MC00032 */
/* ************************************************************************** */
#define EVENT_ID_USER_TSENS_START                         0 /* ID for TSENS event user START */
#define EVENT_ID_USER_PORT_EV_0                           1 /* ID for PORT event user EV_0 */
#define EVENT_ID_USER_PORT_EV_1                           2 /* ID for PORT event user EV_1 */
#define EVENT_ID_USER_PORT_EV_2                           3 /* ID for PORT event user EV_2 */
#define EVENT_ID_USER_PORT_EV_3                           4 /* ID for PORT event user EV_3 */
#define EVENT_ID_USER_DMAC_CH_0                           5 /* ID for DMAC event user CH_0 */
#define EVENT_ID_USER_DMAC_CH_1                           6 /* ID for DMAC event user CH_1 */
#define EVENT_ID_USER_DMAC_CH_2                           7 /* ID for DMAC event user CH_2 */
#define EVENT_ID_USER_DMAC_CH_3                           8 /* ID for DMAC event user CH_3 */
#define EVENT_ID_USER_TCC0_EV_0                           9 /* ID for TCC0 event user EV_0 */
#define EVENT_ID_USER_TCC0_EV_1                          10 /* ID for TCC0 event user EV_1 */
#define EVENT_ID_USER_TCC0_MC_0                          11 /* ID for TCC0 event user MC_0 */
#define EVENT_ID_USER_TCC0_MC_1                          12 /* ID for TCC0 event user MC_1 */
#define EVENT_ID_USER_TCC0_MC_2                          13 /* ID for TCC0 event user MC_2 */
#define EVENT_ID_USER_TCC0_MC_3                          14 /* ID for TCC0 event user MC_3 */
#define EVENT_ID_USER_TCC1_EV_0                          15 /* ID for TCC1 event user EV_0 */
#define EVENT_ID_USER_TCC1_EV_1                          16 /* ID for TCC1 event user EV_1 */
#define EVENT_ID_USER_TCC1_MC_0                          17 /* ID for TCC1 event user MC_0 */
#define EVENT_ID_USER_TCC1_MC_1                          18 /* ID for TCC1 event user MC_1 */
#define EVENT_ID_USER_TCC2_EV_0                          19 /* ID for TCC2 event user EV_0 */
#define EVENT_ID_USER_TCC2_EV_1                          20 /* ID for TCC2 event user EV_1 */
#define EVENT_ID_USER_TCC2_MC_0                          21 /* ID for TCC2 event user MC_0 */
#define EVENT_ID_USER_TCC2_MC_1                          22 /* ID for TCC2 event user MC_1 */
#define EVENT_ID_USER_TC0_EVU                            23 /* ID for TC0 event user EVU */
#define EVENT_ID_USER_TC1_EVU                            24 /* ID for TC1 event user EVU */
#define EVENT_ID_USER_TC2_EVU                            25 /* ID for TC2 event user EVU */
#define EVENT_ID_USER_TC3_EVU                            26 /* ID for TC3 event user EVU */
#define EVENT_ID_USER_TC4_EVU                            27 /* ID for TC4 event user EVU */
#define EVENT_ID_USER_ADC0_START                         28 /* ID for ADC0 event user START */
#define EVENT_ID_USER_ADC0_SYNC                          29 /* ID for ADC0 event user SYNC */
#define EVENT_ID_USER_ADC1_START                         30 /* ID for ADC1 event user START */
#define EVENT_ID_USER_ADC1_SYNC                          31 /* ID for ADC1 event user SYNC */
#define EVENT_ID_USER_SDADC_START                        32 /* ID for SDADC event user START */
#define EVENT_ID_USER_SDADC_FLUSH                        33 /* ID for SDADC event user FLUSH */
#define EVENT_ID_USER_AC_SOC_0                           34 /* ID for AC event user SOC_0 */
#define EVENT_ID_USER_AC_SOC_1                           35 /* ID for AC event user SOC_1 */
#define EVENT_ID_USER_DAC_START                          36 /* ID for DAC event user START */
#define EVENT_ID_USER_CCL_LUTIN_0                        37 /* ID for CCL event user LUTIN_0 */
#define EVENT_ID_USER_CCL_LUTIN_1                        38 /* ID for CCL event user LUTIN_1 */
#define EVENT_ID_USER_CCL_LUTIN_2                        39 /* ID for CCL event user LUTIN_2 */
#define EVENT_ID_USER_CCL_LUTIN_3                        40 /* ID for CCL event user LUTIN_3 */
#define EVENT_ID_USER_MTB_START                          42 /* ID for MTB event user START */
#define EVENT_ID_USER_MTB_STOP                           43 /* ID for MTB event user STOP */
#define EVENT_ID_USER_PDEC_EVU_0                         44 /* ID for PDEC event user EVU_0 */
#define EVENT_ID_USER_PDEC_EVU_1                         45 /* ID for PDEC event user EVU_1 */
#define EVENT_ID_USER_PDEC_EVU_2                         46 /* ID for PDEC event user EVU_2 */

#ifdef __cplusplus
}
#endif

#endif /* _PIC32CM1216MC00032_H_ */

